src/Tasks/ЗадачаИсполнителя/ЗадачаИсполнителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачаИсполнителя</name>
  <addressing>InformationRegister.АдресацияБизнесПроцессов</addressing>
  <attributes>
    <name>Автор</name>
    <comment>Автор бизнес-процесса, который сформировал задачу</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлановая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПлановая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаФактическая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияФактическая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

src/Tasks/ЗадачаИсполнителя/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.БизнесПроцесс.ВедущаяЗадача.БизнесПроцесс) Тогда
		КомплексныйПроцессОбъект = ЭтотОбъект.БизнесПроцесс.ВедущаяЗадача.БизнесПроцесс.ПолучитьОбъект();
		
		СтрокаПроцесса = КомплексныйПроцессОбъект.Этапы.Найти(ЭтотОбъект.БизнесПроцесс, "ЗапущенныйБизнесПроцесс");
		
		Если ЗначениеЗаполнено(СтрокаПроцесса) Тогда
		
			ЭтотОбъект.Исполнитель = СтрокаПроцесса.ОтветственныйИсполнитель;
		КонецЕсли;
	КонецЕсли;
		
		
	
	ЭтотОбъект.ДатаНачалаПлановая    = ЭтотОбъект.БизнесПроцесс.ДатаНачалаПлановая;
	ЭтотОбъект.ДатаОкончанияПлановая = ЭтотОбъект.БизнесПроцесс.ДатаОкончанияПлановая;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаНачалаФактическая) Тогда
		ЭтотОбъект.ДатаНачалаФактическая = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаОкончанияФактическая) И ЭтотОбъект.Выполнена Тогда
		ЭтотОбъект.ДатаОкончанияФактическая = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриВыполнении(Отказ)

	Если ТипЗнч(ЭтотОбъект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.БизнесПроцесс") Тогда
		
		ЭтотОбъект.ДатаОкончанияФактическая = ТекущаяДата();
		
		ТекущийБизнесПроцесс = ЭтотОбъект.БизнесПроцесс.ПолучитьОбъект();
		ТекущийБизнесПроцесс.ЗадачаВыполнена = Истина;
		ТекущийБизнесПроцесс.ДатаНачалаФактическая    = ЭтотОбъект.ДатаНачалаФактическая;
		ТекущийБизнесПроцесс.ДатаОкончанияФактическая = ЭтотОбъект.ДатаОкончанияФактическая;
		ТекущийБизнесПроцесс.Записать();
		
		КомплексныйПроцессОбъект = ЭтотОбъект.БизнесПроцесс.ВедущаяЗадача.БизнесПроцесс.ПолучитьОбъект();

		ТочкаМаршрутаВложенныйПроцесс = БизнесПроцессы.БизнесСобытия.ТочкиМаршрута.ВложенныйПроцесс;
		
		НовыеПроцессы = Новый Массив();
		КомплексныйПроцессОбъект.СтартоватьНовыеДействия(
			НовыеПроцессы, 
			ТочкаМаршрутаВложенныйПроцесс, 
			Истина, 
			ЭтотОбъект.БизнесПроцесс);
			
	Иначе
			
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.БизнесПроцесс.ВедущаяЗадача.БизнесПроцесс) Тогда
		КомплексныйПроцессОбъект = ЭтотОбъект.БизнесПроцесс.ВедущаяЗадача.БизнесПроцесс.ПолучитьОбъект();
		
		СтрокаПроцесса = КомплексныйПроцессОбъект.Этапы.Найти(ЭтотОбъект.БизнесПроцесс, "ЗапущенныйБизнесПроцесс");
		
		Если ЗначениеЗаполнено(СтрокаПроцесса) Тогда
			
			
			СтрокаПроцесса.ДатаНачалаФактическая    = ЭтотОбъект.ДатаНачалаФактическая;
			СтрокаПроцесса.ДатаОкончанияФактическая = ЭтотОбъект.ДатаОкончанияФактическая;
			СтрокаПроцесса.ЗадачаВыполнена          = ЭтотОбъект.Выполнена;
			
			КомплексныйПроцессОбъект.Записать();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
